Config/DataProcessors/ОбработкаДанныхОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаДанныхОтчетности</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/Catalogs/ПравилаЗаполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаЗаполнения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеСНастройками</Name>
					<Comment>При заполнении отчета всегда выводится форма настроек заполнения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительнаяОбработкаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МетодОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнятьПриЗаполнении</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьВМенюЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеВИнтерфейсе</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменяетсяВНастройкеЗаполнения</Name>
							<Comment>Если Истина, отображается в форме "Настройка заполнения" и "Заполнение по документу основанию"</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезПодтверждения</Name>
							<Comment>Если "ОтображатьВМенюЗаполнения" = Истина, то при нажатии на команду в отчете, если "БезПодтверждения" = Истина, не будет открываться окно настроек.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПодсказки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КартыДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТаблицаДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбщиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательскаяДоступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадаетсяСпискомЗначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ОбработкаДанныхОтчетности/Forms/УдалитьПустыеСтроки/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтчета = Параметры.ВидОтчета;
	ПравилоЗаполнения = Параметры.ПравилоЗаполнения;
	Событие = Параметры.Событие;
	
	Если Параметры.Свойство("РеквизитыДокумента") И ЗначениеЗаполнено(Параметры.РеквизитыДокумента) Тогда
		
		РеквизитыДокумента = Параметры.РеквизитыДокумента;
		
		Если ТипЗнч(РеквизитыДокумента) = Тип("Структура") Тогда
			
			Значение = Неопределено;
			Если РеквизитыДокумента.Свойство("ВидОтчета", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
				
				ВидОтчета = Значение;
				
			КонецЕсли;
			
			Значение = Неопределено;
			Если РеквизитыДокумента.Свойство("ПравилоЗаполнения", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ПравилаЗаполнения") Тогда
				
				ПравилоЗаполнения = Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	// Заполнение значений параметров
	Если ТипЗнч(ПараметрыМетода) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыМетода) Тогда
		
		ЗначениеСвойства = Неопределено;
		Если ПараметрыМетода.Свойство("ГруппаРаскрытия", ЗначениеСвойства) Тогда
			ГруппаРаскрытия = ЗначениеСвойства;
			ЗаполнитьПоляГруппировки();
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если ПараметрыМетода.Свойство("ПоляПроверки", ЗначениеСвойства) Тогда
			
			Для Каждого ВыбранноеПоле Из ЗначениеСвойства Цикл
				ЭлементСписка = ПоляПроверки.НайтиПоЗначению(ВыбранноеПоле);
				Если НЕ ЭлементСписка = Неопределено Тогда
					ЭлементСписка.Пометка = Истина;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"МетодыОбработкиДанныхОтчетности");
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ГруппаРаскрытияПриИзменении(Элемент)
	
	ЗаполнитьПоляГруппировки();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	СтруктураВозврата = СохранитьПараметры();
	
	Если ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда
		
		Модифицированность = Ложь;
		
		Закрыть(СтруктураВозврата);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сохранить параметры'"));
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция СохранитьПараметры()
	
	СтруктураВозврата = Новый Структура("АдресПараметров, ПредставлениеПараметров","","");
	
	Если ПустаяСтрока(АдресПараметров) Тогда
		АдресДляСохранения = ЭтаФорма.ВладелецФормы.УникальныйИдентификатор;
	Иначе
		АдресДляСохранения = АдресПараметров;
	КонецЕсли;
	
	Если СохранитьПараметрыНаСервере(АдресДляСохранения) Тогда
		
		СтруктураВозврата.АдресПараметров = АдресПараметров;
		СтруктураВозврата.ПредставлениеПараметров = ПредставлениеПараметров;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СохранитьПараметрыНаСервере(Знач АдресДляСохранения)
	
	Если ПроверитьЗаполнение() Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ГруппаРаскрытия", ГруппаРаскрытия);
		
		ВыбранныеПоля = Новый Массив;
		Для Каждого Поле Из ПоляПроверки Цикл
			Если Поле.Пометка Тогда
				ВыбранныеПоля.Добавить(Поле.Значение);
			КонецЕсли;	
		КонецЦикла;
		СтруктураПараметров.Вставить("ПоляПроверки", ВыбранныеПоля);
		
		ПредставлениеПараметров();
		
		АдресПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметров , АдресДляСохранения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПредставлениеПараметров()
	
	КодГруппы =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаРаскрытия,"Код");
	
	ПредставлениеПараметров = КодГруппы +"(";
	
	СтрокаРазделитель = "";
	Для каждого ЭлементСписка Из ПоляПроверки Цикл
		
		Если ЭлементСписка.Пометка Тогда
			ПредставлениеПараметров = ПредставлениеПараметров + СтрокаРазделитель + ЭлементСписка.Значение;
			
			СтрокаРазделитель = ",";
		КонецЕсли;
		
	КонецЦикла;
	
	ПредставлениеПараметров = ПредставлениеПараметров + ")";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляГруппировки()
	
	ПоляПроверки.Очистить();
	
	КолонкиОтчета = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьКолонкиВидаОтчета(ВидОтчета, , ГруппаРаскрытия);
	
	Для каждого КолонкаПроверки Из КолонкиОтчета Цикл
		
		ПоляПроверки.Добавить(КолонкаПроверки.Код, КолонкаПроверки.Представление);
		
	КонецЦикла;
	
КонецПроцедуры
